* Actions to install =timeoff-management= Application 		  :TOC_2_org:
- [[Configure node version][Configure node version]]
- [[Install node][Install node]]
- [[Clone =timeoff-management= git Repository][Clone =timeoff-management= git Repository]]
- [[Install timeoff package][Install timeoff package]]
- [[Start service][Start service]]

* Configure node version

 #+BEGIN_SRC raw  :noweb yes :eval no :tangle .nvmrc
<<node-version>>
 #+END_SRC


* Install node

 #+name: install-node
 #+BEGIN_SRC sh :eval no :exports code
 nvm install --lts
 #+END_SRC

 #+BEGIN_SRC sh :eval no-export :results output :exports none :noweb yes
 <<nvm>>
 <<install-node>>
 #+END_SRC

 #+RESULTS:
 : Installing latest LTS version.
 : Now using node v8.9.4 (npm v5.6.0)


* Clone =timeoff-management= git Repository

#+name: git-clone
#+BEGIN_SRC sh :eval no-export :results output :dir .
git clone https://github.com/timeoff-management/application timeoff
#+END_SRC

#+RESULTS: git-clone


* Install timeoff package

Run 
#+name: npm-install-def
#+BEGIN_SRC sh :eval no
npm install
#+END_SRC

to install packages used by the application

#+BEGIN_SRC sh :eval no-export :results output :noweb yes :exports none
<<node>>
<<npm-install-def>>
#+END_SRC

#+RESULTS:
#+begin_example

> bufferutil@1.1.0 install /home/jj/work/sbuilder-timeoff-demo/03-virtual-system-test/timeoff/node_modules/bufferutil
> node-gyp rebuild

make: Entering directory `/home/jj/work/sbuilder-timeoff-demo/03-virtual-system-test/timeoff/node_modules/bufferutil/build'
  CXX(target) Release/obj.target/bufferutil/src/bufferutil.o
make: Leaving directory `/home/jj/work/sbuilder-timeoff-demo/03-virtual-system-test/timeoff/node_modules/bufferutil/build'

> dtrace-provider@0.8.6 install /home/jj/work/sbuilder-timeoff-demo/03-virtual-system-test/timeoff/node_modules/dtrace-provider
> node-gyp rebuild || node suppress-error.js

make: Entering directory `/home/jj/work/sbuilder-timeoff-demo/03-virtual-system-test/timeoff/node_modules/dtrace-provider/build'
  TOUCH Release/obj.target/DTraceProviderStub.stamp
make: Leaving directory `/home/jj/work/sbuilder-timeoff-demo/03-virtual-system-test/timeoff/node_modules/dtrace-provider/build'

> utf-8-validate@1.1.0 install /home/jj/work/sbuilder-timeoff-demo/03-virtual-system-test/timeoff/node_modules/utf-8-validate
> node-gyp rebuild

make: Entering directory `/home/jj/work/sbuilder-timeoff-demo/03-virtual-system-test/timeoff/node_modules/utf-8-validate/build'
  CXX(target) Release/obj.target/validation/src/validation.o
make: Leaving directory `/home/jj/work/sbuilder-timeoff-demo/03-virtual-system-test/timeoff/node_modules/utf-8-validate/build'

> node-sass@4.7.2 install /home/jj/work/sbuilder-timeoff-demo/03-virtual-system-test/timeoff/node_modules/node-sass
> node scripts/install.js

Cached binary found at /home/jj/.npm/node-sass/4.7.2/linux-x64-48_binding.node

> sqlite3@3.1.13 install /home/jj/work/sbuilder-timeoff-demo/03-virtual-system-test/timeoff/node_modules/sqlite3
> node-pre-gyp install --fallback-to-build

[sqlite3] Success: "/home/jj/work/sbuilder-timeoff-demo/03-virtual-system-test/timeoff/node_modules/sqlite3/lib/binding/node-v48-linux-x64/node_sqlite3.node" is installed via remote

> node-sass@4.7.2 postinstall /home/jj/work/sbuilder-timeoff-demo/03-virtual-system-test/timeoff/node_modules/node-sass
> node scripts/build.js

Binary found at /home/jj/work/sbuilder-timeoff-demo/03-virtual-system-test/timeoff/node_modules/node-sass/vendor/linux-x64-48/binding.node
Testing binary
Binary is fine
TimeOff.Management@0.10.0 /home/jj/work/sbuilder-timeoff-demo/03-virtual-system-test/timeoff
├── bluebird@2.11.0 
├─┬ body-parser@1.18.2 
│ ├── bytes@3.0.0 
│ ├── content-type@1.0.4 
│ ├── debug@2.6.9 
│ ├── depd@1.1.2 
│ ├─┬ http-errors@1.6.2 
│ │ ├── depd@1.1.1 
│ │ ├── inherits@2.0.3 
│ │ ├── setprototypeof@1.0.3 
│ │ └── statuses@1.4.0 
│ ├── iconv-lite@0.4.19 
│ ├─┬ on-finished@2.3.0 
│ │ └── ee-first@1.1.1 
│ ├── qs@6.5.1 
│ ├─┬ raw-body@2.3.2 
│ │ └── unpipe@1.0.0 
│ └─┬ type-is@1.6.15 
│   ├── media-typer@0.3.0 
│   └─┬ mime-types@2.1.17 
│     └── mime-db@1.30.0 
├─┬ chai@2.3.0 
│ ├── assertion-error@1.0.0 
│ └─┬ deep-eql@0.1.3 
│   └── type-detect@0.1.1 
├─┬ connect-session-sequelize@3.0.0 
│ └── debug@2.6.9 
├─┬ cookie-parser@1.4.3 
│ ├── cookie@0.3.1 
│ └── cookie-signature@1.0.6 
├─┬ csv@0.4.6 
│ ├── csv-generate@0.0.6 
│ ├── csv-parse@1.3.3 
│ ├── csv-stringify@0.0.8 
│ └── stream-transform@0.1.2 
├─┬ debug@2.0.0 
│ └── ms@0.6.2 
├─┬ express@4.16.2 
│ ├─┬ accepts@1.3.4 
│ │ └── negotiator@0.6.1 
│ ├── array-flatten@1.1.1 
│ ├── content-disposition@0.5.2 
│ ├── debug@2.6.9 
│ ├── encodeurl@1.0.2 
│ ├── escape-html@1.0.3 
│ ├── etag@1.8.1 
│ ├─┬ finalhandler@1.1.0 
│ │ ├── debug@2.6.9 
│ │ └── statuses@1.3.1 
│ ├── fresh@0.5.2 
│ ├── merge-descriptors@1.0.1 
│ ├── methods@1.1.2 
│ ├── parseurl@1.3.2 
│ ├── path-to-regexp@0.1.7 
│ ├─┬ proxy-addr@2.0.2 
│ │ ├── forwarded@0.1.2 
│ │ └── ipaddr.js@1.5.2 
│ ├── range-parser@1.2.0 
│ ├── safe-buffer@5.1.1 
│ ├─┬ send@0.16.1 
│ │ ├── debug@2.6.9 
│ │ ├── destroy@1.0.4 
│ │ ├── mime@1.4.1 
│ │ └── statuses@1.3.1 
│ ├── serve-static@1.13.1 
│ ├── setprototypeof@1.1.0 
│ ├── statuses@1.3.1 
│ ├── utils-merge@1.0.1 
│ └── vary@1.1.2 
├─┬ express-handlebars@3.0.0 
│ ├─┬ glob@6.0.4 
│ │ ├─┬ inflight@1.0.6 
│ │ │ └── wrappy@1.0.2 
│ │ ├─┬ minimatch@3.0.4 
│ │ │ └─┬ brace-expansion@1.1.8 
│ │ │   ├── balanced-match@1.0.0 
│ │ │   └── concat-map@0.0.1 
│ │ ├── once@1.4.0 
│ │ └── path-is-absolute@1.0.1 
│ ├── graceful-fs@4.1.11 
│ ├─┬ handlebars@4.0.11 
│ │ ├─┬ source-map@0.4.4 
│ │ │ └── amdefine@1.0.1 
│ │ └─┬ uglify-js@2.8.29 
│ │   ├── source-map@0.5.7 
│ │   ├── uglify-to-browserify@1.0.2 
│ │   └─┬ yargs@3.10.0 
│ │     ├── camelcase@1.2.1 
│ │     ├─┬ cliui@2.1.0 
│ │     │ ├─┬ center-align@0.1.3 
│ │     │ │ ├─┬ align-text@0.1.4 
│ │     │ │ │ └── longest@1.0.1 
│ │     │ │ └── lazy-cache@1.0.4 
│ │     │ ├── right-align@0.1.3 
│ │     │ └── wordwrap@0.0.2 
│ │     └── window-size@0.1.0 
│ ├─┬ object.assign@4.1.0 
│ │ ├─┬ define-properties@1.1.2 
│ │ │ └── foreach@2.0.5 
│ │ ├── function-bind@1.1.1 
│ │ ├── has-symbols@1.0.0 
│ │ └── object-keys@1.0.11 
│ └─┬ promise@7.3.1 
│   └── asap@2.0.6 
├─┬ express-session@1.15.6 
│ ├── crc@3.4.4 
│ ├── debug@2.6.9 
│ ├── on-headers@1.0.1 
│ └─┬ uid-safe@2.1.5 
│   └── random-bytes@1.0.0 
├── formidable@1.0.17 
├─┬ html-to-text@3.3.0 
│ ├── he@1.1.1 
│ ├─┬ htmlparser2@3.9.2 
│ │ ├── domelementtype@1.3.0 
│ │ ├── domhandler@2.4.1 
│ │ ├─┬ domutils@1.6.2 
│ │ │ └─┬ dom-serializer@0.1.0 
│ │ │   └── domelementtype@1.1.3 
│ │ ├── entities@1.1.1 
│ │ └─┬ readable-stream@2.3.3 
│ │   ├── core-util-is@1.0.2 
│ │   ├── isarray@1.0.0 
│ │   ├── process-nextick-args@1.0.7 
│ │   └── string_decoder@1.0.3 
│ └─┬ underscore.string@3.3.4 
│   ├── sprintf-js@1.1.1 
│   └── util-deprecate@1.0.2 
├── ical-generator@0.2.10 
├─┬ joi@12.0.0 
│ ├── hoek@4.2.0 
│ ├─┬ isemail@3.1.0 
│ │ └── punycode@2.1.0 
│ └── topo@2.0.2 
├─┬ ldapauth-fork@2.5.5 
│ ├── bcryptjs@2.3.0 
│ ├─┬ ldapjs@1.0.2 
│ │ ├── asn1@0.2.3 
│ │ ├── assert-plus@1.0.0 
│ │ ├─┬ backoff@2.5.0 
│ │ │ └── precond@0.2.3 
│ │ ├─┬ bunyan@1.8.12 
│ │ │ ├─┬ mv@2.1.1 
│ │ │ │ └── ncp@2.0.0 
│ │ │ └── safe-json-stringify@1.0.4 
│ │ ├── dashdash@1.14.1 
│ │ ├── dtrace-provider@0.8.6 
│ │ ├─┬ ldap-filter@0.2.2 
│ │ │ └── assert-plus@0.1.5 
│ │ ├─┬ vasync@1.6.4 
│ │ │ └── verror@1.6.0 
│ │ └─┬ verror@1.10.0 
│ │   └── extsprintf@1.2.0 
│ └─┬ lru-cache@3.2.0 
│   └── pseudomap@1.0.2 
├─┬ mocha@3.5.3 
│ ├── browser-stdout@1.3.0 
│ ├─┬ commander@2.9.0 
│ │ └── graceful-readlink@1.0.1 
│ ├── debug@2.6.8 
│ ├── diff@3.2.0 
│ ├── escape-string-regexp@1.0.5 
│ ├─┬ glob@7.1.1 
│ │ └── fs.realpath@1.0.0 
│ ├── growl@1.9.2 
│ ├── json3@3.3.2 
│ ├─┬ lodash.create@3.1.1 
│ │ ├─┬ lodash._baseassign@3.2.0 
│ │ │ ├── lodash._basecopy@3.0.1 
│ │ │ └─┬ lodash.keys@3.1.2 
│ │ │   ├── lodash._getnative@3.9.1 
│ │ │   ├── lodash.isarguments@3.1.0 
│ │ │   └── lodash.isarray@3.0.4 
│ │ ├── lodash._basecreate@3.0.3 
│ │ └── lodash._isiterateecall@3.0.9 
│ ├─┬ mkdirp@0.5.1 
│ │ └── minimist@0.0.8 
│ └─┬ supports-color@3.1.2 
│   └── has-flag@1.0.0 
├── moment@2.20.1 
├── moment-timezone@0.5.14 
├─┬ morgan@1.9.0 
│ ├── basic-auth@2.0.0 
│ └── debug@2.6.9 
├─┬ nconf@0.8.5 
│ ├── async@1.5.2 
│ ├── ini@1.3.5 
│ ├── secure-keys@1.0.0 
│ └─┬ yargs@3.32.0 
│   ├── camelcase@2.1.1 
│   ├─┬ cliui@3.2.0 
│   │ └── wrap-ansi@2.1.0 
│   ├── decamelize@1.2.0 
│   ├─┬ os-locale@1.4.0 
│   │ └─┬ lcid@1.0.0 
│   │   └── invert-kv@1.0.0 
│   ├─┬ string-width@1.0.2 
│   │ ├── code-point-at@1.1.0 
│   │ └─┬ is-fullwidth-code-point@1.0.0 
│   │   └── number-is-nan@1.0.1 
│   ├── window-size@0.1.4 
│   └── y18n@3.2.1 
├─┬ node-sass@4.7.2 
│ ├── async-foreach@0.1.3 
│ ├─┬ chalk@1.1.3 
│ │ ├── ansi-styles@2.2.1 
│ │ ├─┬ has-ansi@2.0.0 
│ │ │ └── ansi-regex@2.1.1 
│ │ ├── strip-ansi@3.0.1 
│ │ └── supports-color@2.0.0 
│ ├─┬ cross-spawn@3.0.1 
│ │ ├─┬ lru-cache@4.1.1 
│ │ │ └── yallist@2.1.2 
│ │ └─┬ which@1.3.0 
│ │   └── isexe@2.0.0 
│ ├─┬ gaze@1.1.2 
│ │ └─┬ globule@1.2.0 
│ │   └── lodash@4.17.4 
│ ├── get-stdin@4.0.1 
│ ├── glob@7.1.2 
│ ├── in-publish@2.0.0 
│ ├── lodash.assign@4.2.0 
│ ├── lodash.clonedeep@4.5.0 
│ ├── lodash.mergewith@4.6.0 
│ ├─┬ meow@3.7.0 
│ │ ├─┬ camelcase-keys@2.1.0 
│ │ │ └── camelcase@2.1.1 
│ │ ├─┬ loud-rejection@1.6.0 
│ │ │ ├─┬ currently-unhandled@0.4.1 
│ │ │ │ └── array-find-index@1.0.2 
│ │ │ └── signal-exit@3.0.2 
│ │ ├── map-obj@1.0.1 
│ │ ├── minimist@1.2.0 
│ │ ├─┬ normalize-package-data@2.4.0 
│ │ │ ├── hosted-git-info@2.5.0 
│ │ │ ├─┬ is-builtin-module@1.0.0 
│ │ │ │ └── builtin-modules@1.1.1 
│ │ │ └─┬ validate-npm-package-license@3.0.1 
│ │ │   ├─┬ spdx-correct@1.0.2 
│ │ │   │ └── spdx-license-ids@1.2.2 
│ │ │   └── spdx-expression-parse@1.0.4 
│ │ ├── object-assign@4.1.1 
│ │ ├─┬ read-pkg-up@1.0.1 
│ │ │ ├─┬ find-up@1.1.2 
│ │ │ │ └── path-exists@2.1.0 
│ │ │ └─┬ read-pkg@1.1.0 
│ │ │   ├─┬ load-json-file@1.1.0 
│ │ │   │ ├─┬ parse-json@2.2.0 
│ │ │   │ │ └─┬ error-ex@1.3.1 
│ │ │   │ │   └── is-arrayish@0.2.1 
│ │ │   │ ├── pify@2.3.0 
│ │ │   │ └── strip-bom@2.0.0 
│ │ │   └── path-type@1.1.0 
│ │ ├─┬ redent@1.0.0 
│ │ │ ├─┬ indent-string@2.1.0 
│ │ │ │ └─┬ repeating@2.0.1 
│ │ │ │   └── is-finite@1.0.2 
│ │ │ └── strip-indent@1.0.1 
│ │ └── trim-newlines@1.0.0 
│ ├── nan@2.8.0 
│ ├─┬ node-gyp@3.6.2 
│ │ ├── fstream@1.0.11 
│ │ ├── glob@7.1.2 
│ │ ├─┬ nopt@3.0.6 
│ │ │ └── abbrev@1.1.1 
│ │ ├─┬ osenv@0.1.4 
│ │ │ ├── os-homedir@1.0.2 
│ │ │ └── os-tmpdir@1.0.2 
│ │ ├── semver@5.3.0 
│ │ └─┬ tar@2.2.1 
│ │   └── block-stream@0.0.9 
│ ├─┬ npmlog@4.1.2 
│ │ ├─┬ are-we-there-yet@1.1.4 
│ │ │ └── delegates@1.0.0 
│ │ ├── console-control-strings@1.1.0 
│ │ ├─┬ gauge@2.7.4 
│ │ │ ├── aproba@1.2.0 
│ │ │ ├── has-unicode@2.0.1 
│ │ │ ├── object-assign@4.1.1 
│ │ │ └── wide-align@1.1.2 
│ │ └── set-blocking@2.0.0 
│ ├─┬ request@2.79.0 
│ │ ├── aws-sign2@0.6.0 
│ │ ├── aws4@1.6.0 
│ │ ├── caseless@0.11.0 
│ │ ├─┬ combined-stream@1.0.5 
│ │ │ └── delayed-stream@1.0.0 
│ │ ├── extend@3.0.1 
│ │ ├── forever-agent@0.6.1 
│ │ ├─┬ form-data@2.1.4 
│ │ │ └── asynckit@0.4.0 
│ │ ├─┬ har-validator@2.0.6 
│ │ │ ├── commander@2.13.0 
│ │ │ ├─┬ is-my-json-valid@2.17.1 
│ │ │ │ ├── generate-function@2.0.0 
│ │ │ │ ├─┬ generate-object-property@1.2.0 
│ │ │ │ │ └── is-property@1.0.2 
│ │ │ │ ├── jsonpointer@4.0.1 
│ │ │ │ └── xtend@4.0.1 
│ │ │ └─┬ pinkie-promise@2.0.1 
│ │ │   └── pinkie@2.0.4 
│ │ ├─┬ hawk@3.1.3 
│ │ │ ├─┬ boom@2.10.1 
│ │ │ │ └── hoek@2.16.3 
│ │ │ ├── cryptiles@2.0.5 
│ │ │ ├── hoek@2.16.3 
│ │ │ └─┬ sntp@1.0.9 
│ │ │   └── hoek@2.16.3 
│ │ ├─┬ http-signature@1.1.1 
│ │ │ ├── assert-plus@0.2.0 
│ │ │ ├─┬ jsprim@1.4.1 
│ │ │ │ ├── extsprintf@1.3.0 
│ │ │ │ └── json-schema@0.2.3 
│ │ │ └─┬ sshpk@1.13.1 
│ │ │   ├── bcrypt-pbkdf@1.0.1 
│ │ │   ├── ecc-jsbn@0.1.1 
│ │ │   ├── getpass@0.1.7 
│ │ │   ├── jsbn@0.1.1 
│ │ │   └── tweetnacl@0.14.5 
│ │ ├── is-typedarray@1.0.0 
│ │ ├── isstream@0.1.2 
│ │ ├── json-stringify-safe@5.0.1 
│ │ ├── oauth-sign@0.8.2 
│ │ ├── qs@6.3.2 
│ │ ├── stringstream@0.0.5 
│ │ ├─┬ tough-cookie@2.3.3 
│ │ │ └── punycode@1.4.1 
│ │ ├── tunnel-agent@0.4.3 
│ │ └── uuid@3.2.1 
│ ├─┬ sass-graph@2.2.4 
│ │ ├── glob@7.1.2 
│ │ ├─┬ scss-tokenizer@0.2.3 
│ │ │ └── js-base64@2.4.3 
│ │ └─┬ yargs@7.1.0 
│ │   ├── camelcase@3.0.0 
│ │   ├── cliui@3.2.0 
│ │   └── yargs-parser@5.0.0 
│ ├── stdout-stream@1.4.0 
│ └── true-case-path@1.0.2 
├── node-uuid@1.4.8 
├─┬ nodemailer@1.11.0 
│ ├─┬ libmime@1.2.0 
│ │ ├── libbase64@0.1.0 
│ │ └── libqp@1.1.0 
│ ├─┬ mailcomposer@2.1.0 
│ │ └─┬ buildmail@2.0.0 
│ │   ├── addressparser@0.3.2 
│ │   └─┬ needle@0.10.0 
│ │     └── debug@2.6.9 
│ ├─┬ needle@0.11.0 
│ │ └── debug@2.6.9 
│ └── nodemailer-direct-transport@1.1.0 
├─┬ nodemailer-smtp-transport@1.1.0 
│ ├── clone@1.0.3 
│ ├── nodemailer-wellknown@0.1.10 
│ └── smtp-connection@1.3.8 
├─┬ optimist@0.6.1 
│ ├── minimist@0.0.10 
│ └── wordwrap@0.0.3 
├─┬ passport@0.3.2 
│ ├── passport-strategy@1.0.0 
│ └── pause@0.0.1 
├── passport-local@1.0.0 
├─┬ selenium-webdriver@2.45.1 
│ ├── adm-zip@0.4.4 
│ ├── rimraf@2.4.5 
│ ├── tmp@0.0.24 
│ ├─┬ ws@0.7.2 
│ │ ├── options@0.0.6 
│ │ └── ultron@1.0.2 
│ └─┬ xml2js@0.4.4 
│   ├── sax@0.6.1 
│   └── xmlbuilder@9.0.4 
├─┬ sequelize@3.31.1 
│ ├── bluebird@3.5.1 
│ ├── dottie@1.1.1 
│ ├── generic-pool@2.4.2 
│ ├── inflection@1.12.0 
│ ├── lodash@4.12.0 
│ ├─┬ retry-as-promised@2.3.2 
│ │ ├── bluebird@3.5.1 
│ │ └── debug@2.6.9 
│ ├── semver@5.5.0 
│ ├── shimmer@1.1.0 
│ ├─┬ terraformer-wkt-parser@1.1.2 
│ │ └─┬ terraformer@1.0.8 
│ │   └── @types/geojson@1.0.6 
│ ├── toposort-class@1.0.1 
│ ├── uuid@3.2.1 
│ ├── validator@5.7.0 
│ └── wkx@0.2.0 
├─┬ sequelize-cli@2.5.1 
│ ├── bluebird@3.5.1 
│ ├─┬ cli-color@0.3.3 
│ │ ├── d@0.1.1 
│ │ ├─┬ es5-ext@0.10.38 
│ │ │ ├─┬ es6-iterator@2.0.3 
│ │ │ │ └── d@1.0.0 
│ │ │ └─┬ es6-symbol@3.1.1 
│ │ │   └── d@1.0.0 
│ │ ├─┬ memoizee@0.3.10 
│ │ │ ├─┬ es6-weak-map@0.1.4 
│ │ │ │ ├── es6-iterator@0.1.3 
│ │ │ │ └── es6-symbol@2.0.1 
│ │ │ ├─┬ event-emitter@0.3.5 
│ │ │ │ └── d@1.0.0 
│ │ │ ├── lru-queue@0.1.0 
│ │ │ └── next-tick@0.2.2 
│ │ └─┬ timers-ext@0.1.2 
│ │   └── next-tick@1.0.0 
│ ├─┬ findup-sync@0.4.3 
│ │ ├─┬ detect-file@0.1.0 
│ │ │ └── fs-exists-sync@0.1.0 
│ │ ├─┬ is-glob@2.0.1 
│ │ │ └── is-extglob@1.0.0 
│ │ ├─┬ micromatch@2.3.11 
│ │ │ ├─┬ arr-diff@2.0.0 
│ │ │ │ └── arr-flatten@1.1.0 
│ │ │ ├── array-unique@0.2.1 
│ │ │ ├─┬ braces@1.8.5 
│ │ │ │ ├─┬ expand-range@1.8.2 
│ │ │ │ │ └─┬ fill-range@2.2.3 
│ │ │ │ │   ├── is-number@2.1.0 
│ │ │ │ │   ├── isobject@2.1.0 
│ │ │ │ │   ├─┬ randomatic@1.1.7 
│ │ │ │ │   │ ├─┬ is-number@3.0.0 
│ │ │ │ │   │ │ └── kind-of@3.2.2 
│ │ │ │ │   │ └── kind-of@4.0.0 
│ │ │ │ │   └── repeat-string@1.6.1 
│ │ │ │ ├── preserve@0.2.0 
│ │ │ │ └── repeat-element@1.1.2 
│ │ │ ├─┬ expand-brackets@0.1.5 
│ │ │ │ └── is-posix-bracket@0.1.1 
│ │ │ ├── extglob@0.3.2 
│ │ │ ├── filename-regex@2.0.1 
│ │ │ ├─┬ kind-of@3.2.2 
│ │ │ │ └── is-buffer@1.1.6 
│ │ │ ├─┬ normalize-path@2.1.1 
│ │ │ │ └── remove-trailing-separator@1.1.0 
│ │ │ ├─┬ object.omit@2.0.1 
│ │ │ │ ├─┬ for-own@0.1.5 
│ │ │ │ │ └── for-in@1.0.2 
│ │ │ │ └── is-extendable@0.1.1 
│ │ │ ├─┬ parse-glob@3.0.4 
│ │ │ │ ├─┬ glob-base@0.3.0 
│ │ │ │ │ └── glob-parent@2.0.0 
│ │ │ │ └── is-dotfile@1.0.3 
│ │ │ └─┬ regex-cache@0.4.4 
│ │ │   └─┬ is-equal-shallow@0.1.3 
│ │ │     └── is-primitive@2.0.0 
│ │ └─┬ resolve-dir@0.1.1 
│ │   ├── expand-tilde@1.2.2 
│ │   └─┬ global-modules@0.2.3 
│ │     ├─┬ global-prefix@0.1.5 
│ │     │ └─┬ homedir-polyfill@1.0.1 
│ │     │   └── parse-passwd@1.0.0 
│ │     └── is-windows@0.2.0 
│ ├─┬ fs-extra@1.0.0 
│ │ ├── jsonfile@2.4.0 
│ │ └── klaw@1.3.1 
│ ├─┬ gulp@3.9.1 
│ │ ├── archy@1.0.0 
│ │ ├── deprecated@0.0.1 
│ │ ├─┬ gulp-util@3.0.8 
│ │ │ ├── array-differ@1.0.0 
│ │ │ ├── array-uniq@1.0.3 
│ │ │ ├── beeper@1.1.1 
│ │ │ ├── dateformat@2.2.0 
│ │ │ ├─┬ fancy-log@1.3.2 
│ │ │ │ ├─┬ ansi-gray@0.1.1 
│ │ │ │ │ └── ansi-wrap@0.1.0 
│ │ │ │ ├── color-support@1.1.3 
│ │ │ │ └── time-stamp@1.1.0 
│ │ │ ├─┬ gulplog@1.0.0 
│ │ │ │ └── glogg@1.0.1 
│ │ │ ├─┬ has-gulplog@0.1.0 
│ │ │ │ └── sparkles@1.0.0 
│ │ │ ├── lodash._reescape@3.0.0 
│ │ │ ├── lodash._reevaluate@3.0.0 
│ │ │ ├── lodash._reinterpolate@3.0.0 
│ │ │ ├─┬ lodash.template@3.6.2 
│ │ │ │ ├── lodash._basetostring@3.0.1 
│ │ │ │ ├── lodash._basevalues@3.0.0 
│ │ │ │ ├─┬ lodash.escape@3.2.0 
│ │ │ │ │ └── lodash._root@3.0.1 
│ │ │ │ ├── lodash.restparam@3.6.1 
│ │ │ │ └── lodash.templatesettings@3.1.1 
│ │ │ ├── minimist@1.2.0 
│ │ │ ├─┬ multipipe@0.1.2 
│ │ │ │ └─┬ duplexer2@0.0.2 
│ │ │ │   └─┬ readable-stream@1.1.14 
│ │ │ │     ├── isarray@0.0.1 
│ │ │ │     └── string_decoder@0.10.31 
│ │ │ ├── replace-ext@0.0.1 
│ │ │ ├── through2@2.0.3 
│ │ │ └─┬ vinyl@0.5.3 
│ │ │   └── clone-stats@0.0.1 
│ │ ├── interpret@1.1.0 
│ │ ├─┬ liftoff@2.5.0 
│ │ │ ├─┬ findup-sync@2.0.0 
│ │ │ │ ├── detect-file@1.0.0 
│ │ │ │ ├─┬ is-glob@3.1.0 
│ │ │ │ │ └── is-extglob@2.1.1 
│ │ │ │ ├─┬ micromatch@3.1.5 
│ │ │ │ │ ├── arr-diff@4.0.0 
│ │ │ │ │ ├── array-unique@0.3.2 
│ │ │ │ │ ├─┬ braces@2.3.0 
│ │ │ │ │ │ ├─┬ fill-range@4.0.0 
│ │ │ │ │ │ │ ├─┬ is-number@3.0.0 
│ │ │ │ │ │ │ │ └── kind-of@3.2.2 
│ │ │ │ │ │ │ └─┬ to-regex-range@2.1.1 
│ │ │ │ │ │ │   └── is-number@3.0.0 
│ │ │ │ │ │ ├── isobject@3.0.1 
│ │ │ │ │ │ ├─┬ snapdragon-node@2.1.1 
│ │ │ │ │ │ │ ├── isobject@3.0.1 
│ │ │ │ │ │ │ └── snapdragon-util@3.0.1 
│ │ │ │ │ │ └─┬ split-string@3.1.0 
│ │ │ │ │ │   └─┬ extend-shallow@3.0.2 
│ │ │ │ │ │     ├── assign-symbols@1.0.0 
│ │ │ │ │ │     └── is-extendable@1.0.1 
│ │ │ │ │ ├─┬ define-property@1.0.0 
│ │ │ │ │ │ └─┬ is-descriptor@1.0.2 
│ │ │ │ │ │   ├─┬ is-accessor-descriptor@1.0.0 
│ │ │ │ │ │   │ └── kind-of@6.0.2 
│ │ │ │ │ │   ├─┬ is-data-descriptor@1.0.0 
│ │ │ │ │ │   │ └── kind-of@6.0.2 
│ │ │ │ │ │   └── kind-of@6.0.2 
│ │ │ │ │ ├── extend-shallow@2.0.1 
│ │ │ │ │ ├─┬ extglob@2.0.4 
│ │ │ │ │ │ └─┬ expand-brackets@2.1.4 
│ │ │ │ │ │   ├── debug@2.6.9 
│ │ │ │ │ │   ├─┬ define-property@0.2.5 
│ │ │ │ │ │   │ └─┬ is-descriptor@0.1.6 
│ │ │ │ │ │   │   ├─┬ is-accessor-descriptor@0.1.6 
│ │ │ │ │ │   │   │ └── kind-of@3.2.2 
│ │ │ │ │ │   │   ├─┬ is-data-descriptor@0.1.4 
│ │ │ │ │ │   │   │ └── kind-of@3.2.2 
│ │ │ │ │ │   │   └── kind-of@5.1.0 
│ │ │ │ │ │   └── posix-character-classes@0.1.1 
│ │ │ │ │ ├── fragment-cache@0.2.1 
│ │ │ │ │ ├── kind-of@6.0.2 
│ │ │ │ │ ├─┬ nanomatch@1.2.7 
│ │ │ │ │ │ ├── arr-diff@4.0.0 
│ │ │ │ │ │ ├── array-unique@0.3.2 
│ │ │ │ │ │ ├─┬ is-odd@1.0.0 
│ │ │ │ │ │ │ └── is-number@3.0.0 
│ │ │ │ │ │ └── kind-of@5.1.0 
│ │ │ │ │ ├── regex-not@1.0.0 
│ │ │ │ │ ├─┬ snapdragon@0.8.1 
│ │ │ │ │ │ ├─┬ base@0.11.2 
│ │ │ │ │ │ │ ├─┬ cache-base@1.0.1 
│ │ │ │ │ │ │ │ ├─┬ collection-visit@1.0.0 
│ │ │ │ │ │ │ │ │ ├── map-visit@1.0.0 
│ │ │ │ │ │ │ │ │ └─┬ object-visit@1.0.1 
│ │ │ │ │ │ │ │ │   └── isobject@3.0.1 
│ │ │ │ │ │ │ │ ├── get-value@2.0.6 
│ │ │ │ │ │ │ │ ├─┬ has-value@1.0.0 
│ │ │ │ │ │ │ │ │ ├─┬ has-values@1.0.0 
│ │ │ │ │ │ │ │ │ │ ├─┬ is-number@3.0.0 
│ │ │ │ │ │ │ │ │ │ │ └── kind-of@3.2.2 
│ │ │ │ │ │ │ │ │ │ └── kind-of@4.0.0 
│ │ │ │ │ │ │ │ │ └── isobject@3.0.1 
│ │ │ │ │ │ │ │ ├── isobject@3.0.1 
│ │ │ │ │ │ │ │ ├── set-value@2.0.0 
│ │ │ │ │ │ │ │ ├── to-object-path@0.3.0 
│ │ │ │ │ │ │ │ ├─┬ union-value@1.0.0 
│ │ │ │ │ │ │ │ │ └── set-value@0.4.3 
│ │ │ │ │ │ │ │ └─┬ unset-value@1.0.0 
│ │ │ │ │ │ │ │   ├─┬ has-value@0.3.1 
│ │ │ │ │ │ │ │   │ ├── has-values@0.1.4 
│ │ │ │ │ │ │ │   │ └── isobject@2.1.0 
│ │ │ │ │ │ │ │   └── isobject@3.0.1 
│ │ │ │ │ │ │ ├─┬ class-utils@0.3.6 
│ │ │ │ │ │ │ │ ├── arr-union@3.1.0 
│ │ │ │ │ │ │ │ ├─┬ define-property@0.2.5 
│ │ │ │ │ │ │ │ │ └─┬ is-descriptor@0.1.6 
│ │ │ │ │ │ │ │ │   ├─┬ is-accessor-descriptor@0.1.6 
│ │ │ │ │ │ │ │ │   │ └── kind-of@3.2.2 
│ │ │ │ │ │ │ │ │   ├─┬ is-data-descriptor@0.1.4 
│ │ │ │ │ │ │ │ │   │ └── kind-of@3.2.2 
│ │ │ │ │ │ │ │ │   └── kind-of@5.1.0 
│ │ │ │ │ │ │ │ ├── isobject@3.0.1 
│ │ │ │ │ │ │ │ └─┬ static-extend@0.1.2 
│ │ │ │ │ │ │ │   ├─┬ define-property@0.2.5 
│ │ │ │ │ │ │ │   │ └─┬ is-descriptor@0.1.6 
│ │ │ │ │ │ │ │   │   ├─┬ is-accessor-descriptor@0.1.6 
│ │ │ │ │ │ │ │   │   │ └── kind-of@3.2.2 
│ │ │ │ │ │ │ │   │   ├─┬ is-data-descriptor@0.1.4 
│ │ │ │ │ │ │ │   │   │ └── kind-of@3.2.2 
│ │ │ │ │ │ │ │   │   └── kind-of@5.1.0 
│ │ │ │ │ │ │ │   └─┬ object-copy@0.1.0 
│ │ │ │ │ │ │ │     ├── copy-descriptor@0.1.1 
│ │ │ │ │ │ │ │     └─┬ define-property@0.2.5 
│ │ │ │ │ │ │ │       └─┬ is-descriptor@0.1.6 
│ │ │ │ │ │ │ │         ├── is-accessor-descriptor@0.1.6 
│ │ │ │ │ │ │ │         ├── is-data-descriptor@0.1.4 
│ │ │ │ │ │ │ │         └── kind-of@5.1.0 
│ │ │ │ │ │ │ ├── component-emitter@1.2.1 
│ │ │ │ │ │ │ ├── isobject@3.0.1 
│ │ │ │ │ │ │ ├─┬ mixin-deep@1.3.0 
│ │ │ │ │ │ │ │ └── is-extendable@1.0.1 
│ │ │ │ │ │ │ └── pascalcase@0.1.1 
│ │ │ │ │ │ ├── debug@2.6.9 
│ │ │ │ │ │ ├─┬ define-property@0.2.5 
│ │ │ │ │ │ │ └─┬ is-descriptor@0.1.6 
│ │ │ │ │ │ │   ├─┬ is-accessor-descriptor@0.1.6 
│ │ │ │ │ │ │   │ └── kind-of@3.2.2 
│ │ │ │ │ │ │   ├─┬ is-data-descriptor@0.1.4 
│ │ │ │ │ │ │   │ └── kind-of@3.2.2 
│ │ │ │ │ │ │   └── kind-of@5.1.0 
│ │ │ │ │ │ ├── source-map@0.5.7 
│ │ │ │ │ │ ├─┬ source-map-resolve@0.5.1 
│ │ │ │ │ │ │ ├── atob@2.0.3 
│ │ │ │ │ │ │ ├── decode-uri-component@0.2.0 
│ │ │ │ │ │ │ ├── resolve-url@0.2.1 
│ │ │ │ │ │ │ ├── source-map-url@0.4.0 
│ │ │ │ │ │ │ └── urix@0.1.0 
│ │ │ │ │ │ └─┬ use@2.0.2 
│ │ │ │ │ │   ├─┬ define-property@0.2.5 
│ │ │ │ │ │   │ └─┬ is-descriptor@0.1.6 
│ │ │ │ │ │   │   ├─┬ is-accessor-descriptor@0.1.6 
│ │ │ │ │ │   │   │ └── kind-of@3.2.2 
│ │ │ │ │ │   │   ├─┬ is-data-descriptor@0.1.4 
│ │ │ │ │ │   │   │ └── kind-of@3.2.2 
│ │ │ │ │ │   │   └── kind-of@5.1.0 
│ │ │ │ │ │   ├── isobject@3.0.1 
│ │ │ │ │ │   └─┬ lazy-cache@2.0.2 
│ │ │ │ │ │     └── set-getter@0.1.0 
│ │ │ │ │ └─┬ to-regex@3.0.1 
│ │ │ │ │   └─┬ define-property@0.2.5 
│ │ │ │ │     └─┬ is-descriptor@0.1.6 
│ │ │ │ │       ├─┬ is-accessor-descriptor@0.1.6 
│ │ │ │ │       │ └── kind-of@3.2.2 
│ │ │ │ │       ├─┬ is-data-descriptor@0.1.4 
│ │ │ │ │       │ └── kind-of@3.2.2 
│ │ │ │ │       └── kind-of@5.1.0 
│ │ │ │ └─┬ resolve-dir@1.0.1 
│ │ │ │   ├── expand-tilde@2.0.2 
│ │ │ │   └─┬ global-modules@1.0.0 
│ │ │ │     ├── global-prefix@1.0.2 
│ │ │ │     └── is-windows@1.0.1 
│ │ │ ├─┬ fined@1.1.0 
│ │ │ │ ├── expand-tilde@2.0.2 
│ │ │ │ ├─┬ object.defaults@1.1.0 
│ │ │ │ │ ├── array-each@1.0.1 
│ │ │ │ │ ├── array-slice@1.1.0 
│ │ │ │ │ ├── for-own@1.0.0 
│ │ │ │ │ └── isobject@3.0.1 
│ │ │ │ ├─┬ object.pick@1.3.0 
│ │ │ │ │ └── isobject@3.0.1 
│ │ │ │ └─┬ parse-filepath@1.0.2 
│ │ │ │   ├─┬ is-absolute@1.0.0 
│ │ │ │   │ ├─┬ is-relative@1.0.0 
│ │ │ │   │ │ └─┬ is-unc-path@1.0.0 
│ │ │ │   │ │   └── unc-path-regex@0.1.2 
│ │ │ │   │ └── is-windows@1.0.1 
│ │ │ │   ├── map-cache@0.2.2 
│ │ │ │   └─┬ path-root@0.1.1 
│ │ │ │     └── path-root-regex@0.1.2 
│ │ │ ├── flagged-respawn@1.0.0 
│ │ │ ├─┬ is-plain-object@2.0.4 
│ │ │ │ └── isobject@3.0.1 
│ │ │ ├─┬ object.map@1.0.1 
│ │ │ │ ├── for-own@1.0.0 
│ │ │ │ └── make-iterator@1.0.0 
│ │ │ └── rechoir@0.6.2 
│ │ ├── minimist@1.2.0 
│ │ ├─┬ orchestrator@0.3.8 
│ │ │ ├─┬ end-of-stream@0.1.5 
│ │ │ │ └── once@1.3.3 
│ │ │ ├── sequencify@0.0.7 
│ │ │ └── stream-consume@0.1.0 
│ │ ├── pretty-hrtime@1.0.3 
│ │ ├── semver@4.3.6 
│ │ ├── tildify@1.2.0 
│ │ ├─┬ v8flags@2.1.1 
│ │ │ └── user-home@1.1.1 
│ │ └─┬ vinyl-fs@0.3.14 
│ │   ├── defaults@1.0.3 
│ │   ├─┬ glob-stream@3.1.18 
│ │   │ ├── glob@4.5.3 
│ │   │ ├─┬ glob2base@0.0.12 
│ │   │ │ └── find-index@0.1.1 
│ │   │ ├── minimatch@2.0.10 
│ │   │ ├── ordered-read-streams@0.1.0 
│ │   │ ├─┬ through2@0.6.5 
│ │   │ │ └─┬ readable-stream@1.0.34 
│ │   │ │   ├── isarray@0.0.1 
│ │   │ │   └── string_decoder@0.10.31 
│ │   │ └── unique-stream@1.0.0 
│ │   ├─┬ glob-watcher@0.0.6 
│ │   │ └─┬ gaze@0.5.2 
│ │   │   └─┬ globule@0.1.0 
│ │   │     ├─┬ glob@3.1.21 
│ │   │     │ ├── graceful-fs@1.2.3 
│ │   │     │ └── inherits@1.0.2 
│ │   │     ├── lodash@1.0.2 
│ │   │     └─┬ minimatch@0.2.14 
│ │   │       └── lru-cache@2.7.3 
│ │   ├─┬ graceful-fs@3.0.11 
│ │   │ └── natives@1.1.1 
│ │   ├─┬ strip-bom@1.0.0 
│ │   │ ├── first-chunk-stream@1.0.0 
│ │   │ └── is-utf8@0.2.1 
│ │   ├─┬ through2@0.6.5 
│ │   │ └─┬ readable-stream@1.0.34 
│ │   │   ├── isarray@0.0.1 
│ │   │   └── string_decoder@0.10.31 
│ │   └─┬ vinyl@0.4.6 
│ │     └── clone@0.2.0 
│ ├─┬ gulp-help@1.6.1 
│ │ └── object-assign@3.0.0 
│ ├─┬ js-beautify@1.7.5 
│ │ ├─┬ config-chain@1.1.11 
│ │ │ └── proto-list@1.2.4 
│ │ └─┬ editorconfig@0.13.3 
│ │   ├── bluebird@3.5.1 
│ │   └── sigmund@1.0.1 
│ ├─┬ resolve@1.5.0 
│ │ └── path-parse@1.0.5 
│ ├─┬ umzug@1.12.0 
│ │ ├── bluebird@3.5.1 
│ │ ├── lodash@4.17.4 
│ │ └── redefine@0.2.1 
│ └─┬ yargs@6.6.0 
│   ├── camelcase@3.0.0 
│   ├── cliui@3.2.0 
│   ├── get-caller-file@1.0.2 
│   ├── require-directory@2.1.1 
│   ├── require-main-filename@1.0.1 
│   ├── which-module@1.0.0 
│   └─┬ yargs-parser@4.2.1 
│     └── camelcase@3.0.0 
├─┬ serve-favicon@2.4.5 
│ └── ms@2.0.0 
├─┬ sqlite3@3.1.13 
│ ├── nan@2.7.0 
│ └─┬ node-pre-gyp@0.6.38 
│   ├─┬ hawk@3.1.3 
│   │ ├── boom@2.10.1 
│   │ ├── cryptiles@2.0.5 
│   │ ├── hoek@2.16.3 
│   │ └── sntp@1.0.9 
│   ├─┬ mkdirp@0.5.1 
│   │ └── minimist@0.0.8 
│   ├─┬ nopt@4.0.1 
│   │ ├── abbrev@1.1.1 
│   │ └─┬ osenv@0.1.4 
│   │   ├── os-homedir@1.0.2 
│   │   └── os-tmpdir@1.0.2 
│   ├─┬ npmlog@4.1.2 
│   │ ├─┬ are-we-there-yet@1.1.4 
│   │ │ └── delegates@1.0.0 
│   │ ├── console-control-strings@1.1.0 
│   │ ├─┬ gauge@2.7.4 
│   │ │ ├── aproba@1.2.0 
│   │ │ ├── has-unicode@2.0.1 
│   │ │ ├── object-assign@4.1.1 
│   │ │ ├── signal-exit@3.0.2 
│   │ │ ├─┬ string-width@1.0.2 
│   │ │ │ ├── code-point-at@1.1.0 
│   │ │ │ └─┬ is-fullwidth-code-point@1.0.0 
│   │ │ │   └── number-is-nan@1.0.1 
│   │ │ ├─┬ strip-ansi@3.0.1 
│   │ │ │ └── ansi-regex@2.1.1 
│   │ │ └── wide-align@1.1.2 
│   │ └── set-blocking@2.0.0 
│   ├─┬ rc@1.2.1 
│   │ ├── deep-extend@0.4.2 
│   │ ├── ini@1.3.4 
│   │ ├── minimist@1.2.0 
│   │ └── strip-json-comments@2.0.1 
│   ├─┬ request@2.81.0 
│   │ ├── aws-sign2@0.6.0 
│   │ ├── aws4@1.6.0 
│   │ ├── caseless@0.12.0 
│   │ ├─┬ combined-stream@1.0.5 
│   │ │ └── delayed-stream@1.0.0 
│   │ ├── extend@3.0.1 
│   │ ├── forever-agent@0.6.1 
│   │ ├─┬ form-data@2.1.4 
│   │ │ └── asynckit@0.4.0 
│   │ ├─┬ har-validator@4.2.1 
│   │ │ ├─┬ ajv@4.11.8 
│   │ │ │ ├── co@4.6.0 
│   │ │ │ └─┬ json-stable-stringify@1.0.1 
│   │ │ │   └── jsonify@0.0.0 
│   │ │ └── har-schema@1.0.5 
│   │ ├─┬ http-signature@1.1.1 
│   │ │ ├── assert-plus@0.2.0 
│   │ │ ├─┬ jsprim@1.4.1 
│   │ │ │ ├── assert-plus@1.0.0 
│   │ │ │ ├── extsprintf@1.3.0 
│   │ │ │ ├── json-schema@0.2.3 
│   │ │ │ └─┬ verror@1.10.0 
│   │ │ │   └── assert-plus@1.0.0 
│   │ │ └─┬ sshpk@1.13.1 
│   │ │   ├── asn1@0.2.3 
│   │ │   ├── assert-plus@1.0.0 
│   │ │   ├── bcrypt-pbkdf@1.0.1 
│   │ │   ├─┬ dashdash@1.14.1 
│   │ │   │ └── assert-plus@1.0.0 
│   │ │   ├── ecc-jsbn@0.1.1 
│   │ │   ├─┬ getpass@0.1.7 
│   │ │   │ └── assert-plus@1.0.0 
│   │ │   ├── jsbn@0.1.1 
│   │ │   └── tweetnacl@0.14.5 
│   │ ├── is-typedarray@1.0.0 
│   │ ├── isstream@0.1.2 
│   │ ├── json-stringify-safe@5.0.1 
│   │ ├─┬ mime-types@2.1.17 
│   │ │ └── mime-db@1.30.0 
│   │ ├── oauth-sign@0.8.2 
│   │ ├── performance-now@0.2.0 
│   │ ├── qs@6.4.0 
│   │ ├── safe-buffer@5.1.1 
│   │ ├── stringstream@0.0.5 
│   │ ├─┬ tough-cookie@2.3.3 
│   │ │ └── punycode@1.4.1 
│   │ ├── tunnel-agent@0.6.0 
│   │ └── uuid@3.1.0 
│   ├─┬ rimraf@2.6.2 
│   │ └─┬ glob@7.1.2 
│   │   ├── fs.realpath@1.0.0 
│   │   ├── inflight@1.0.6 
│   │   ├─┬ minimatch@3.0.4 
│   │   │ └─┬ brace-expansion@1.1.8 
│   │   │   ├── balanced-match@1.0.0 
│   │   │   └── concat-map@0.0.1 
│   │   └── path-is-absolute@1.0.1 
│   ├── semver@5.4.1 
│   ├─┬ tar@2.2.1 
│   │ ├── block-stream@0.0.9 
│   │ ├─┬ fstream@1.0.11 
│   │ │ └── graceful-fs@4.1.11 
│   │ └── inherits@2.0.3 
│   └─┬ tar-pack@3.4.0 
│     ├─┬ debug@2.6.9 
│     │ └── ms@2.0.0 
│     ├── fstream-ignore@1.0.5 
│     ├─┬ once@1.4.0 
│     │ └── wrappy@1.0.2 
│     ├─┬ readable-stream@2.3.3 
│     │ ├── core-util-is@1.0.2 
│     │ ├── isarray@1.0.0 
│     │ ├── process-nextick-args@1.0.7 
│     │ ├── string_decoder@1.0.3 
│     │ └── util-deprecate@1.0.2 
│     └── uid-number@0.0.6 
├── underscore@1.8.3 
└── validator@3.43.0 

#+end_example


* Start service

Launch a application server in a new termial window with the command

#+name: launch-server
#+BEGIN_SRC sh :eval no 
(cd timeoff; npm start)
#+END_SRC

#+BEGIN_SRC sh :eval no-export :noweb yes :exports none :dir .
<<node>>
<<launch-server>>
npm start
#+END_SRC

#+BEGIN_SRC elisp :noweb yes :results output :eval no-export :exports none
(start-process "server" "buf-server" "xterm" "-hold" "-e" "npm" "start" )
#+END_SRC

#+RESULTS:

and open a browser with the address [[http://localhost:3000]]


* Fin								   :noexport:

** Babel configs: working directory ..				   :noexport:

#+PROPERTY: header-args:sh :dir timeoff
#+PROPERTY: header-args:js :dir timeoff
#+PROPERTY: header-args:ruby :dir timeoff
#+PROPERTY: header-args:elisp :dir timeoff


** nowebs							   :noexport:

*** Node version 

#+name: node-version
#+BEGIN_SRC ruby :eval no
lts/boron
#+END_SRC


*** node 

#+name: node
#+BEGIN_SRC sh :eval no
. $NVM_DIR/nvm.sh
export PATH=$(npm bin):$PATH
#+END_SRC


*** nvm 

#+name: nvm
#+BEGIN_SRC sh :eval no
. $NVM_DIR/nvm.sh
#+END_SRC



*** Emacs variables


# Local Variables:
# org-confirm-babel-evaluate: nil
# End:


